{
  "changelog": [
    {
      "versionName": "1.0.0",
      "description": "Welcome to CodeOps Studio, our premier Android code editor. This initial release boasts an array of features designed to enhance your coding experience: \n\n\nFeatures:\n\n\n- Robust text editing capabilities.\n\n\n- Comprehensive syntax highlighting for over 50 major programming languages and 300+ file extensions and sub-language variants.\n\n\n- Essential file management functionalities: create, open, save, and close files.\n\n\n- Customizable theme options for the editor.\n\n\n- Integrated search and replace functionality.\n\n\n- Git repository cloning.\n\n\n- In-app HTML preview and JavaScript console.\n\n\n- Remote HTML preview for sharing via hotspot or internet.\n\n\n- Multi-file support and universal file editor.\n\n\n- Code formatting and importing of zip projects.- Singleton window system.\n\n\n- Breadcrumbs file navigation.\n\n\n- Access to recently opened projects and creation of projects from templates.\n\n\n- Extensive code editor customization support, including default save file encoding and font ligatures.\n\n\n- Integration with Material You design.\n\n\n- Binary file detection and handling of unsupported file encodings.\n\n\n- Logging support.\n\n\n- Optimised features for improved productivity.\n\n\n- Implemented automatic crash log collection to gather crash reports seamlessly.\n\n\n- Utilized crash logs for continuous application improvement, ensuring stability and performance enhancements.\n\n\n\n\nKnown Issues:\n\n\n- File tree manager optimization may be lacking, particularly noticeable on less powerful devices.\n\n\n- Auto-completion window may not match the editor's theme.\n\n\n- JavaScript console in the live preview pane may occasionally fail to load.\n\n\nContributors:  \n\n\n- Main Developer: EUP https://x.com/euptron  \n\n\n- Alpha Testers: \n\n • Etido Asanga Henry https://x.com/AsangaEtid49822\n\n • Ike https://github.com/ike10101 \n\n\n\nThank you for choosing CodeOps Studio. We're committed to continually enhancing your coding journey.\n",
      "releaseDate": 1716961516827,
      "releaseType": "stable",
      "hasVersionName": true
    },
    {
      "versionName": "1.0.1 beta",
      "description": "We're excited to bring you the latest improvements and fixes in CodeOps Studio 1.0.1 beta! This release focuses on performance optimizations, enhanced compatibility, and several bug fixes.\n\nFeatures:\n- File tree refresh option.\n- AST Core Module for better node management.\n- Support for .apk file installation.\n- Progress listener for case conversion.\n- Improved symbol auto-completion.\n\nChanges:\n- Disabled code obfuscation and resource shrinking by proguard as it broke the last version.\n\nImprovements:\n- Optimized file tree loading and memory usage.\n- Refactored code base for better maintainability.\n- Optimized line text duplication and binary file detection.\n- Enhanced crash handling.\n\nBug Fixes:\n- Fixed case conversion failure.\n- Resolved multiple crashes related to null object references.\n- Fixed issues with JavaScript engine initialization and fragment context attachment.\n\nFor the full changelog, visit https://github.com/euptron/CodeOps-Studio/CHANGELOG.md.\n",
      "releaseDate": 1726204800000,
      "releaseType": "beta",
      "hasVersionName": true
    }
  ]
}